tutorials/incompressible/icoDyMFoam/turboPassageRotating/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    movingwalls
    {
        type            zeroGradient;
    }
    rotor_cyclic_upper
    {
        type            cyclicGgi;
    }
    rotor_cyclic_lower
    {
        type            cyclicGgi;
    }
    stator_cyclics
    {
        type            cyclic;
    }
    interface1
    {
        type            overlapGgi;
    }
    interface2
    {
        type            overlapGgi;
    }
}


// ************************************************************************* //
